USE KASPER_MyNewBase;

INSERT into STUDENTS (student_id, student_name, student_surname) values
		('7554339', 'Анягин', 'Литон'),
		('4711931', 'Евгерович', 'Кения'),
		('0000001', 'Кокель', 'Бовля'),
		('0000002', 'Дежко', 'Бонис'),
		('0000003', 'Валичко', 'Велера'),
		('0000004', 'Навкель', 'Востя'),
		('0000005', 'Дежемесов', 'Макар');

INSERT into DISCIPLINES (discipline_code, discipline_name, discipline_lk, discipline_lb, discipline_pz) values 
		('ООП', 'Объектно-ориентированное программирование', 36, 36, 0),
		('БД', 'Базы данных', 36, 36, 0),
		('ЭВМ', 'Основы электронно-вычислительных машин', 18, 36, 0),
		('ОЗИ', 'Основы защиты информации', 18, 0, 36),
		('ЭКНМК', 'Интегрированный модуль "Экономика"', 72, 0, 36);

INSERT into CREDITS (discipline_code, student_id, credit_mark) values 
		('ООП', '0000005', 8),		
		('ООП', '0000001', 4),
		('БД', '0000002', 7),
		('БД', '0000003', 8),
		
	    ('ООП', '4711931', 6),
	    ('БД', '4711931', 7),
	    ('ЭВМ', '4711931', 8),
	    ('ОЗИ', '4711931', 7),
	    ('ЭКНМК', '4711931', 8),

		('ООП', '0000001', 4),
		('БД', '0000001', 4),
		('ЭВМ', '0000001', 4),
		('ОЗИ', '0000001', 4),
		('ЭКНМК', '0000001', 4);